{"keras_version": "2.0.6", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "batch_input_shape": [null, 128, 128, 3], "dtype": "float32", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "valid", "activation": "linear", "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "filters": 32, "trainable": true, "use_bias": true, "name": "conv2d_11", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_15", "activation": "relu"}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "padding": "valid", "activation": "linear", "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "conv2d_12", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_16", "activation": "relu"}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "padding": "valid", "activation": "linear", "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "conv2d_13", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_17", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_5", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_7", "rate": 0.25}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "padding": "valid", "activation": "linear", "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "conv2d_14", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_18", "activation": "relu"}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "padding": "valid", "activation": "linear", "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "conv2d_15", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_19", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_6", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_8", "rate": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_3", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "kernel_regularizer": null, "units": 512, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_20", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_9", "rate": 0.5}}, {"class_name": "Dense", "config": {"name": "dense_6", "trainable": true, "kernel_regularizer": null, "units": 5, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_21", "activation": "softmax"}}], "backend": "tensorflow"}